In [33]:
import pandas as pd

**1. Wczytanie danych z pliku**

In [34]:
Wielkopolskie = pd.read_csv("../Original Data/14_WIELKOPOLSKIE.csv")
Wielkopolskie

,Unnamed: 0,Dni od zakupu,Marka,Wiek kupującego,Płeć kupującego,Ocena
0,0,3,Electrolux,41.0,M,3.0
1,1,7,Electrolux,57.0,M,3.0
2,2,9,Electrolux,NaN,K,4.5
3,3,8,Beko,NaN,M,1.5
4,4,10,Beko,35.0,M,2.5
...,...,...,...,...,...,...
529,529,8,Samsung,39.0,M,1.5
530,530,9,Electrolux,26.0,K,1.5
531,531,6,Beko,43.0,M,2.5
532,532,5,Beko,NaN,M,2.5
533,533,9,Electrolux,57.0,K,1.5

**2. Usunięcie kolumny z indeksami**

In [35]:
Wielkopolskie = Wielkopolskie.drop('Unnamed: 0', axis=1)
Wielkopolskie

     Dni od zakupu       Marka  Wiek kupującego Płeć kupującego  Ocena
0                3  Electrolux             41.0               M    3.0
1                7  Electrolux             57.0               M    3.0
2                9  Electrolux              NaN               K    4.5
3                8        Beko              NaN               M    1.5
4               10        Beko             35.0               M    2.5
..             ...         ...              ...             ...    ...
529              8     Samsung             39.0               M    1.5
530              9  Electrolux             26.0               K    1.5
531              6        Beko             43.0               M    2.5
532              5        Beko              NaN               M    2.5
533              9  Electrolux             57.0               K    1.5

[534 rows x 5 columns]

**3. Usunięcie rekordów niezawierających wieku kupującego**

In [36]:
Wielkopolskie = Wielkopolskie.dropna(axis=0)
Wielkopolskie

     Dni od zakupu       Marka  Wiek kupującego Płeć kupującego  Ocena
0                3  Electrolux             41.0               M    3.0
1                7  Electrolux             57.0               M    3.0
4               10        Beko             35.0               M    2.5
5                5        Beko             53.0               M    2.0
6                5  Electrolux             27.0               K    4.5
..             ...         ...              ...             ...    ...
528              2       Dyson             39.0               M    3.0
529              8     Samsung             39.0               M    1.5
530              9  Electrolux             26.0               K    1.5
531              6        Beko             43.0               M    2.5
533              9  Electrolux             57.0               K    1.5

[473 rows x 5 columns]

**4. Usunięcie rekordów niezawierających płci kupującego**

In [37]:
Wielkopolskie = Wielkopolskie[Wielkopolskie['Płeć kupującego'] != 'bd.']
Wielkopolskie

     Dni od zakupu       Marka  Wiek kupującego Płeć kupującego  Ocena
0                3  Electrolux             41.0               M    3.0
1                7  Electrolux             57.0               M    3.0
4               10        Beko             35.0               M    2.5
5                5        Beko             53.0               M    2.0
6                5  Electrolux             27.0               K    4.5
..             ...         ...              ...             ...    ...
528              2       Dyson             39.0               M    3.0
529              8     Samsung             39.0               M    1.5
530              9  Electrolux             26.0               K    1.5
531              6        Beko             43.0               M    2.5
533              9  Electrolux             57.0               K    1.5

[458 rows x 5 columns]

**5. Zmiana nazwy kolumn tak, aby nie zawierały spacji oraz polskich znaków**

In [38]:
# Wielkopolskie = Wielkopolskie.rename({'Dni od zakupu': 'Dni_od_zakupu','Wiek kupującego': 'Wiek_kupujacego', 'Płeć kupującego': 'Plec_kupujacego'}, axis=1)
# Wielkopolskie

**6. Zapis przetworzonych danych do pliku**

In [39]:
Wielkopolskie.to_csv("../Analysis Data/14_WIELKOPOLSKIE_final.csv", index=False)